doe/results_full_30deg/cases/case_06/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];

// Moderate axial startup. potentialFoam will be used to promote this
// to a divergence-free field before the main solver runs.
internalField   uniform (0 0 5);

// DoE tokens (replaced per-case by stamp_cases.py) :
//    10      = main pipe bulk inlet velocity [m/s]  (default 10)
//    26.143    = branch pipe bulk inlet velocity [m/s] (= VR * UMAIN)
//    0.46         = main pipe diameter [m]
//    0.13631         = branch pipe diameter [m]
//
// The main_inlet uses a 1/7th power-law profile so the mesh sees a fully
// developed turbulent pipe flow from the upstream end (R3a spirit, without
// the headache of a mapped BC).  The branch_inlet likewise uses a 1/7th
// power-law profile centred on its own axis, which represents an injector
// with ~12 D_branch of upstream development -- consistent with Forney &
// Kwon (1979) and most industrial co-flow mixer tees.
boundaryField
{
    wall { type noSlip; }
    sym  { type symmetryPlane; }

    main_inlet
    {
        type            codedFixedValue;
        value           uniform (0 0 10);
        name            mainInletPowerLaw;
        code
        #{
            const vectorField& Cf = this->patch().Cf();
            vectorField& field = *this;
            const scalar d    = 0.46;
            const scalar uMax = 10;
            const scalar n    = 7.0;
            forAll(Cf, i)
            {
                const scalar r = Foam::sqrt(sqr(Cf[i].x()) + sqr(Cf[i].y()));
                const scalar arg = Foam::max(1.0 - sqr(2.0*r/d), scalar(0));
                const scalar u = uMax * Foam::pow(arg, 1.0/n);
                field[i] = vector(0, 0, u);
            }
        #};
    }

    outlet { type pressureInletOutletVelocity; value uniform (0 0 5); }

    // 1/7th power-law profile on the branch inlet, in the tilted branch
    // frame.  Branch axis basis:
    //   junction  = (0, R1, Z_JCT)
    //   S_HAT     = (0, sin(alpha), -cos(alpha))       junction -> inlet
    //   E1        = (1, 0, 0)
    //   E2        = (0, cos(alpha),  sin(alpha))       = E1 x S_HAT
    // A point on the inlet disc sits at p = centre + r*(cos(phi)*E1 + sin(phi)*E2)
    // so r = |p_perp| where p_perp = (p - centre) - ((p-centre).S_HAT)*S_HAT.
    // Flow direction is -S_HAT = (0, -sin(alpha), cos(alpha)).  At alpha=90
    // this reduces to the original 'velocity = (0, -u, 0)' formulation.
    branch_inlet
    {
        type            codedFixedValue;
        value           uniform (0 -13.0715 22.6405);
        name            branchInletPowerLaw;
        code
        #{
            const vectorField& Cf = this->patch().Cf();
            vectorField& field = *this;
            const scalar d    = 0.13631;
            const scalar uMax = 26.143;
            const scalar zc   = 2.3;
            const scalar yJ   = 0.23;
            const scalar sa   = 0.5;
            const scalar ca   = 0.866025;
            const scalar n    = 7.0;
            forAll(Cf, i)
            {
                // Vector from junction to face centre.
                const scalar wx = Cf[i].x();
                const scalar wy = Cf[i].y() - yJ;
                const scalar wz = Cf[i].z() - zc;
                // Axial projection on S_HAT = (0, sa, -ca).
                const scalar sProj = wy*sa + wz*(-ca);
                // Perpendicular component.
                const scalar ppx = wx;                   // E1=(1,0,0)
                const scalar ppy = wy - sProj*sa;
                const scalar ppz = wz - sProj*(-ca);
                const scalar r   = Foam::sqrt(ppx*ppx + ppy*ppy + ppz*ppz);
                const scalar arg = Foam::max(1.0 - sqr(2.0*r/d), scalar(0));
                const scalar u   = uMax * Foam::pow(arg, 1.0/n);
                // Velocity along -S_HAT = (0, -sa, ca).
                field[i] = vector(0.0, -u*sa, u*ca);
            }
        #};
    }
}
